/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   21_11_11_ BinaryTree.c                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/11 16:03:08 by areggie           #+#    #+#             */
/*   Updated: 2021/11/11 16:14:31 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

 //Динамические структуры данных

/*
Понятие Бинарного Дерева 
объсняется графически на Simple Code:

https://www.youtube.com/watch?v=9o_i0zzxk1s&list=PLQOaTSbfxUtAIipl4136nwb4ISyFk8oI4&index=6

название видео: 
Бинарное дерево. Полное понимание! Динамические структуры данных #3

*/


