/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   21_11_11_DEQue.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/11 16:13:31 by areggie           #+#    #+#             */
/*   Updated: 2021/11/11 16:14:23 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Динамические структуры данных

/*
Понятие Очереди c приоритетом
объсняется графически на Simple Code:

https://www.youtube.com/watch?v=xU1wAcoSwf4&list=PLQOaTSbfxUtAIipl4136nwb4ISyFk8oI4&index=10

название видео: 
Дек | Deque | Динамические структуры данных #7
*/