/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   21_11_11_PrQueue.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/11 16:11:25 by areggie           #+#    #+#             */
/*   Updated: 2021/11/11 16:14:44 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

 //Динамические структуры данных

/*
Понятие Очереди c приоритетом
объсняется графически на Simple Code:

https://www.youtube.com/watch?v=y_2toG5-j_M&list=PLQOaTSbfxUtAIipl4136nwb4ISyFk8oI4&index=9

название видео: 
Очередь с приоритетом | Кольцевая очередь | Динамические структуры данных #6
*/