/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   21_11_11_Stack.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/11 16:06:10 by areggie           #+#    #+#             */
/*   Updated: 2021/11/11 16:14:53 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

 //Динамические структуры данных

/*
Понятие  Стека
объсняется графически на Simple Code:

https://www.youtube.com/watch?v=B3VHHfMW0Pg&list=PLQOaTSbfxUtAIipl4136nwb4ISyFk8oI4&index=7

название видео: 
Стек как структура данных. Полное понимание! Динамические структуры данных #4
*/