/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   21_11_11_Queue.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/11 16:09:50 by areggie           #+#    #+#             */
/*   Updated: 2021/11/11 16:14:48 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

 //Динамические структуры данных

/*
Понятие Очереди
объсняется графически на Simple Code:

https://www.youtube.com/watch?v=fmHyFTji-Lc&list=PLQOaTSbfxUtAIipl4136nwb4ISyFk8oI4&index=8

название видео: 

Очередь как структура данных. Динамические структуры данных #5
*/