/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   21_11_11_linked_list_intro.c                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/11 13:58:41 by areggie           #+#    #+#             */
/*   Updated: 2022/02/12 19:07:29 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

 //Динамические структуры данных

/*
Понятие односвязного списка 
объсняется графически на Simple Code:
https://www.youtube.com/watch?v=C9FK1pHLnhI&list=PLQOaTSbfxUtAIipl4136nwb4ISyFk8oI4

https://www.youtube.com/watch?v=C9FK1pHLnhI

название видео: Односвязный список | Динамические структуры данных #1


ПРЕИМУЩЕСТВО списка - можно добавлять/удалять элементы в конец или в середину

НЕДОСТАТОК - медленный доступ к элементу
так как нужно найти конец
нужно посчитать элементы потом двигаться

Частично этот недостаток доступа по адресу закрывает двунаправленный список
*/


/*В следующих трех видео есть реализация односвязного списка:

https://www.youtube.com/watch?v=SajrPhE6FoQ&list=PLQOaTSbfxUtAIipl4136nwb4ISyFk8oI4&index=2
Реализация односвязного списка c++ Часть 1 | Урок #133
Реализация односвязного списка c++ Часть 2 | Урок #134
Реализация односвязного списка c++ Часть 3 | Урок #135


*/

