/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   21_11_11_twoDirLinkedList.c                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/11 15:58:36 by areggie           #+#    #+#             */
/*   Updated: 2022/02/12 18:52:50 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

 //Динамические структуры данных

/*
Понятие двусвязного списка 
объясняется графически на Simple Code:

https://www.youtube.com/watch?v=lQ-lPjbb9Ew&list=PLQOaTSbfxUtAIipl4136nwb4ISyFk8oI4&index=5

название видео: 
Двусвязный список | Динамические структуры данных #2

*/



