/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Kasper_task10.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/15 15:00:30 by areggie           #+#    #+#             */
/*   Updated: 2022/05/15 18:13:55 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*

в cpp это библиотека <cstddef>
вывод 3 не 12

*/

#include <stdio.h>
#include <stddef.h> // 

int main()
{
	int a[10];
	ptrdiff_t diff = &a[8] - &a[5];

	printf("%td\n", diff);
	
	return 0;
}