/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Kasper_task8.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/15 14:51:01 by areggie           #+#    #+#             */
/*   Updated: 2022/05/15 14:53:33 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int main()
{
	int i = 5;
	int a = 2;

	i = i++; // сперва присваивает а потом увеличивает
	a = ++a; // здесь увеличивает а потом присваивает
	

	printf("%d\n", i);
	printf("%d\n", a);
	return 0;
}